lelebrr/Willy_ESP32_S3/src/core/tftLogger/tftLogger.cpp
#include <cstddef>
#include <esp32-hal-psram.h>
#include <globals.h>
#include <tftLogger.h>

/*
AUXILIARY FUNCTIONS TO CREATE THE JSONS
*/

/* TFT LOGGER FUNCTIONS */
tft_logger::tft_logger(int16_t w, int16_t h) : WILLY_TFT_DRIVER(w, h) {}
tft_logger::~tft_logger() {
  clearLog();
  if (log)
    free(log);
  if (images)
    free(images);
  log = nullptr;
  images = nullptr;
}

void tft_logger::clearLog() {
  if (log)
    memset(log, 0, sizeof(tftLog) * MAX_LOG_ENTRIES);
  if (images)
    memset(images, 0, MAX_LOG_IMAGES * MAX_LOG_IMG_PATH);
  logWriteIndex = 0;
  logCount = 0;
}

void tft_logger::addLogEntry(const uint8_t *buffer, uint8_t size) {
  if (!log)
    return;
  memcpy(log[logWriteIndex].data, buffer, size);
  logWriteIndex = (logWriteIndex + 1) % MAX_LOG_ENTRIES;
  if (logCount < MAX_LOG_ENTRIES)
    ++logCount;
}

void tft_logger::logWriteHeader(uint8_t *buffer, uint8_t &pos, tftFuncs fn) {
  buffer[pos++] = LOG_PACKET_HEADER;
  buffer[pos++] = 0; // placeholder size
  buffer[pos++] = fn;
}

void tft_logger::writeUint16(uint8_t *buffer, uint8_t &pos, uint16_t value) {
  buffer[pos++] = (value >> 8) & 0xFF;
  buffer[pos++] = value & 0xFF;
}

void tft_logger::checkAndLog(tftFuncs fn, ...) {
  if (!log)
    return;

  uint8_t buffer[MAX_LOG_SIZE];
  uint8_t pos = 0;

  // Write header
  logWriteHeader(buffer, pos, fn);

  // Process variadic arguments based on function type
  va_list args;
  va_start(args, fn);

  switch (fn) {
  case FILLSCREEN:
    // color (int32_t)
    writeUint16(buffer, pos, (uint16_t)va_arg(args, int32_t));
    break;

  case DRAWLINE:
  case DRAWRECT:
  case FILLRECT:
  case DRAWROUNDRECT:
  case FILLROUNDRECT:
  case DRAWCIRCLE:
  case FILLCIRCLE:
  case DRAWELIPSE:
  case FILLELIPSE:
  case DRAWWIDELINE:
  case DRAWFASTVLINE:
  case DRAWFASTHLINE:
    // x, y, ... parameters (mostly int32_t)
    // For simplicity, handle common patterns
    if (fn == DRAWLINE || fn == DRAWRECT || fn == FILLRECT ||
        fn == DRAWROUNDRECT || fn == FILLROUNDRECT) {
      // x, y, w/h, r, color
      int32_t x = va_arg(args, int32_t);
      int32_t y = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)x);
      writeUint16(buffer, pos, (uint16_t)y);
      if (fn == DRAWLINE) {
        int32_t x1 = va_arg(args, int32_t);
        int32_t y1 = va_arg(args, int32_t);
        writeUint16(buffer, pos, (uint16_t)x1);
        writeUint16(buffer, pos, (uint16_t)y1);
      } else {
        int32_t w = va_arg(args, int32_t);
        int32_t h = va_arg(args, int32_t);
        writeUint16(buffer, pos, (uint16_t)w);
        writeUint16(buffer, pos, (uint16_t)h);
        if (fn == DRAWROUNDRECT || fn == FILLROUNDRECT) {
          int32_t r = va_arg(args, int32_t);
          writeUint16(buffer, pos, (uint16_t)r);
        }
      }
      int32_t color = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)color);
    } else if (fn == DRAWCIRCLE || fn == FILLCIRCLE) {
      int32_t x = va_arg(args, int32_t);
      int32_t y = va_arg(args, int32_t);
      int32_t r = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)x);
      writeUint16(buffer, pos, (uint16_t)y);
      writeUint16(buffer, pos, (uint16_t)r);
      int32_t color = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)color);
    } else if (fn == DRAWELIPSE || fn == FILLELIPSE) {
      int32_t x = va_arg(args, int32_t);
      int32_t y = va_arg(args, int32_t);
      int32_t rx = va_arg(args, int32_t);
      int32_t ry = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)x);
      writeUint16(buffer, pos, (uint16_t)y);
      writeUint16(buffer, pos, (uint16_t)rx);
      writeUint16(buffer, pos, (uint16_t)ry);
      int32_t color = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)color);
    } else if (fn == DRAWTRIAGLE || fn == FILLTRIANGLE) {
      int32_t x1 = va_arg(args, int32_t);
      int32_t y1 = va_arg(args, int32_t);
      int32_t x2 = va_arg(args, int32_t);
      int32_t y2 = va_arg(args, int32_t);
      int32_t x3 = va_arg(args, int32_t);
      int32_t y3 = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)x1);
      writeUint16(buffer, pos, (uint16_t)y1);
      writeUint16(buffer, pos, (uint16_t)x2);
      writeUint16(buffer, pos, (uint16_t)y2);
      writeUint16(buffer, pos, (uint16_t)x3);
      writeUint16(buffer, pos, (uint16_t)y3);
      int32_t color = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)color);
    } else if (fn == DRAWARC) {
      int32_t x = va_arg(args, int32_t);
      int32_t y = va_arg(args, int32_t);
      int32_t r = va_arg(args, int32_t);
      int32_t ir = va_arg(args, int32_t);
      int32_t startAngle = va_arg(args, int32_t);
      int32_t endAngle = va_arg(args, int32_t);
      int32_t fg_color = va_arg(args, int32_t);
      int32_t bg_color = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)x);
      writeUint16(buffer, pos, (uint16_t)y);
      writeUint16(buffer, pos, (uint16_t)r);
      writeUint16(buffer, pos, (uint16_t)ir);
      writeUint16(buffer, pos, (uint16_t)startAngle);
      writeUint16(buffer, pos, (uint16_t)endAngle);
      writeUint16(buffer, pos, (uint16_t)fg_color);
      writeUint16(buffer, pos, (uint16_t)bg_color);
    } else if (fn == DRAWWIDELINE) {
      float ax = va_arg(args, double);
      float ay = va_arg(args, double);
      float bx = va_arg(args, double);
      float by = va_arg(args, double);
      float wd = va_arg(args, double);
      int32_t fg = va_arg(args, int32_t);
      int32_t bg = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)ax);
      writeUint16(buffer, pos, (uint16_t)ay);
      writeUint16(buffer, pos, (uint16_t)bx);
      writeUint16(buffer, pos, (uint16_t)by);
      writeUint16(buffer, pos, (uint16_t)wd);
      writeUint16(buffer, pos, (uint16_t)fg);
      writeUint16(buffer, pos, (uint16_t)bg);
    }
    break;

  case DRAWPIXEL:
    // x, y, color
    {
      int32_t x = va_arg(args, int32_t);
      int32_t y = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)x);
      writeUint16(buffer, pos, (uint16_t)y);
      int32_t color = va_arg(args, int32_t);
      writeUint16(buffer, pos, (uint16_t)color);
    }
    break;

  default:
    // Unknown function, skip
    break;
  }

  va_end(args);

  // Update size byte
  buffer[1] = pos;

  // Create log entry
  tftLog l;
  memcpy(l.data, buffer, pos);
  pushLogIfUnique(l);
}

void tft_logger::setLogging(bool _log) {
  clearLog();
  if (_log) {
    size_t logBytes = sizeof(tftLog) * MAX_LOG_ENTRIES;
    size_t imageBytes = MAX_LOG_IMAGES * MAX_LOG_IMG_PATH;
    if (psramFound()) {
      log = static_cast<tftLog *>(ps_malloc(logBytes));
      images = static_cast<char (*)[MAX_LOG_IMG_PATH]>(ps_malloc(imageBytes));
    }
    if (!log)
      log = static_cast<tftLog *>(malloc(logBytes));
    if (!images)
      images = static_cast<char (*)[MAX_LOG_IMG_PATH]>(malloc(imageBytes));
    if (!log)
      log_e("tft_logger: failed to allocate log buffer (%u bytes)",
            (unsigned)logBytes);
    if (!images)
      log_e("tft_logger: failed to allocate image buffer (%u bytes)",
            (unsigned)imageBytes);
    if (!log || !images) {
      if (log) {
        free(log);
        log = nullptr;
      }
      if (images) {
        free(images);
        images = nullptr;
      }
      _log = false;
      log_e("tft_logger: failed to start logging screen data due to "
            "insufficient memory");
    }
  } else {
    if (log)
      free(log);
    if (images)
      free(images);
    log = nullptr;
    images = nullptr;
  }
  logging = _logging = _log;
  logWriteIndex = 0;
  if (log)
    memset(log, 0, sizeof(tftLog) * MAX_LOG_ENTRIES);
  logCount = 0;
};
