lelebrr/Willy_ESP32_S3/src/core/tftLogger/tftLogger.cpp
void tft_logger::asyncSerialTaskFunc(void *pv) {
  tft_logger *logger = static_cast<tft_logger *>(pv);
  tftLog item;
  while (logger->async_serial ||
         uxQueueMessagesWaiting(logger->asyncSerialQueue) > 0) {
    if (xQueueReceive(logger->asyncSerialQueue, &item, pdMS_TO_TICKS(100))) {
      uint8_t *entry = item.data;
      uint8_t fn = entry[2];
      if (fn == DRAWIMAGE) {
        if (!logger->images) {
          uint8_t size = entry[1];
          serialDevice->write(entry, size);
          continue;
        }
        uint8_t imageSlot = entry[12];
        const char *imgPath = logger->images[imageSlot];
        size_t baseLen = 12; // AA SS FN XX XX YY YY Ce Ce Ms Ms FS
        size_t imgLen = strlen(imgPath);
        uint8_t packet[MAX_LOG_SIZE];
        memcpy(packet, entry, baseLen);
        if (imgLen > MAX_LOG_SIZE - baseLen)
          imgLen = MAX_LOG_SIZE - baseLen;
        memcpy(packet + baseLen, imgPath, imgLen);
        packet[1] = baseLen + imgLen;
        serialDevice->write(packet, baseLen + imgLen);
      } else {
        uint8_t size = entry[1];
        serialDevice->write(entry, size);
      }
    }
  }
  logger->asyncSerialTask = NULL;
  if (logger->asyncSerialQueue) {
    vQueueDelete(logger->asyncSerialQueue);
    logger->asyncSerialQueue = NULL;
  }
  vTaskDelete(NULL);
}

void tft_logger::startAsyncSerial() {
  if (async_serial)
    return;
  async_serial = true;
  setLogging(true);
  asyncSerialQueue = xQueueCreate(MAX_LOG_ENTRIES, sizeof(tftLog));
  getTftInfo();
  // Can it work with 2048 bytes of heap??
  xTaskCreate(asyncSerialTaskFunc, "async_serial", 4096, this, 1,
              &asyncSerialTask);
}

void tft_logger::stopAsyncSerial() {
  if (!async_serial)
    return;
  async_serial = false;
  setLogging(false);
  // task will exit on its own and clear handle
}
void tft_logger::getTftInfo() {
  uint8_t buffer[16];
  uint8_t pos = 0;
  logWriteHeader(buffer, pos, SCREEN_INFO);
  writeUint16(buffer, pos, width());
  writeUint16(buffer, pos, height());
  uint8_t rot = 0;
#if defined(HAS_SCREEN)
  rot = getRotation();
#endif
  buffer[pos++] = rot;
  buffer[1] = pos;
  tftLog l;
  memcpy(l.data, buffer, pos);
  pushLogIfUnique(l);
}
void tft_logger::getBinLog(uint8_t *outBuffer, size_t &outSize) {
  outSize = 0;
  // add Screen Info at the beginning of the Bin packet
  uint8_t buffer[16];
  uint8_t pos = 0;
  logWriteHeader(buffer, pos, SCREEN_INFO);
  writeUint16(buffer, pos, width());
  writeUint16(buffer, pos, height());
  uint8_t rot = 0;
#if defined(HAS_SCREEN)
  rot = getRotation();
#endif
  buffer[pos++] = rot;
  buffer[1] = pos;

  memcpy(outBuffer + outSize, buffer, pos);
  outSize += pos;

  if (!log)
    return;
  for (int i = 0; i < logCount; i++) {
    if (log[i].data[0] != LOG_PACKET_HEADER)
      continue;
    uint8_t *entry = log[i].data;
    uint8_t fn = entry[2];

    if (fn == DRAWIMAGE) {
      if (!images)
        continue;
      uint8_t imageSlot = entry[12]; // AA SS FN XX XX YY YY Ce Ce Ms Ms FS SLOT
                                     // 0  1  2  3  4  5  6  7  8  9  10 11 12
      const char *imgPath = images[imageSlot];
      size_t baseLen = 12; // AA SS FN XX XX YY YY Ce Ce Ms Ms FS + PATH
      size_t imgLen = strlen(imgPath);
      if (outSize + baseLen + imgLen > MAX_LOG_SIZE * MAX_LOG_ENTRIES)
        continue;

      memcpy(outBuffer + outSize, entry, baseLen);
      outSize += baseLen;
      memcpy(outBuffer + outSize, imgPath, imgLen);
      outSize += imgLen;

      outBuffer[outSize - imgLen - baseLen + 1] =
          baseLen + imgLen; // update packet size
    } else {
      uint8_t size = entry[1];
      if (outSize + size > MAX_LOG_SIZE * MAX_LOG_ENTRIES)
        continue;
      memcpy(outBuffer + outSize, entry, size);
      outSize += size;
    }
  }
}

void tft_logger::restoreLogger() {
  if (_logging)
    logging = true;
}

bool tft_logger::isLogEqual(const tftLog &a, const tftLog &b) {
  uint8_t sizeA = a.data[1];
  uint8_t sizeB = b.data[1];
  if (sizeA != sizeB)
    return false;
  return memcmp(a.data, b.data, sizeA) == 0;
}

void tft_logger::pushLogIfUnique(const tftLog &l) {
  if (!log)
    return;
  for (int i = 0; i < logCount; i++) {
    if (isLogEqual(log[i], l)) {
      return; // Entry already exists
    }
  }
  memcpy(log[logWriteIndex].data, l.data, l.data[1]);
  logWriteIndex = (logWriteIndex + 1) % MAX_LOG_ENTRIES;
  if (logCount < MAX_LOG_ENTRIES)
    ++logCount;
  if (async_serial && asyncSerialQueue) {
    xQueueSend(asyncSerialQueue, &l, 0);
  }
}

bool tft_logger::removeLogEntriesInsideRect(int rx, int ry, int rw, int rh) {
  bool r = false;
  int rx1 = rx;
  int ry1 = ry;
  int rx2 = rx + rw;
  int ry2 = ry + rh;

  if (!log)
    return false;
  for (int i = 0; i < logCount; i++) {
    uint8_t *data = log[i].data;
    if (data[0] != LOG_PACKET_HEADER)
      continue;
    int px = (data[3] << 8) | data[4];
    int py = (data[5] << 8) | data[6];
    if (px >= rx1 && px < rx2 && py >= ry1 && py < ry2) {
      data[0] = 0; // Mark as deleted
      r = true;
    }
  }
  return r;
}

void tft_logger::removeOverlappedImages(int x, int y, int center, int ms) {
  if (!log)
    return;
  for (int i = 0; i < logCount; i++) {
    uint8_t *data = log[i].data;
    if (data[0] != LOG_PACKET_HEADER)
      continue;
    uint8_t fn = data[2];
    if (fn != DRAWIMAGE)
      continue;
    int px = (data[3] << 8) | data[4];
    int py = (data[5] << 8) | data[6];
    int pcenter = (data[7] << 8) | data[8];
    int pms = (data[9] << 8) | data[10];
    if (px == x && py == y && pcenter == center && pms == ms) {
      data[0] = 0; // Mark as deleted
    }
  }
}

void tft_logger::fillScreen(uint32_t color) {
  if (logging) {
    clearLog();
    checkAndLog(FILLSCREEN, color);
  }
  if (isSleeping)
    return;
  extern SemaphoreHandle_t spiMutex;
  if (spiMutex && xSemaphoreTake(spiMutex, pdMS_TO_TICKS(1000)) == pdTRUE) {
    WILLY_TFT_DRIVER::fillScreen(color);
    xSemaphoreGive(spiMutex);
  }
}

void tft_logger::imageToBin(uint8_t fs, String file, int x, int y, bool center,
                            int Ms) {
  if (!logging)
    return;
  if (!log || !images)
    return;

