lelebrr/Willy_ESP32_S3/src/core/tftLogger/tftLogger.cpp
  removeOverlappedImages(x, y, center, Ms);

  // Try to find or store in images[MAX_LOG_IMAGES][MAX_LOG_IMG_PATH];
  uint8_t imageSlot = 0xFF;
  for (int i = 0; i < MAX_LOG_IMAGES; ++i) {
    if (strcmp(images[i], file.c_str()) == 0) {
      imageSlot = i;
      break;
    }
  }
  if (imageSlot == 0xFF) {
    for (int i = 0; i < MAX_LOG_IMAGES; ++i) {
      if (images[i][0] == 0) {
        strncpy(images[i], file.c_str(), sizeof(images[i]) - 1);
        images[i][sizeof(images[i]) - 1] = 0;
        imageSlot = i;
        break;
      }
    }
  }

  // Use image path as identifier in log.data
  uint8_t buffer[MAX_LOG_SIZE];
  uint8_t pos = 0;
  logWriteHeader(buffer, pos, DRAWIMAGE);

  writeUint16(buffer, pos, x);
  writeUint16(buffer, pos, y);
  writeUint16(buffer, pos, center);
  writeUint16(buffer, pos, Ms);
  buffer[pos++] = fs; // 0=SD and 2=LittleFS
  buffer[pos++] = imageSlot;

  // Store the file path string in the remainder of the buffer
  size_t fileLen = strlen(images[imageSlot]);
  size_t maxLen = MAX_LOG_SIZE - pos;
  if (fileLen > maxLen)
    fileLen = maxLen;
  memcpy(buffer + pos, images[imageSlot], fileLen);
  pos += fileLen;

  buffer[1] = pos; // update size

  tftLog l;
  memcpy(l.data, buffer, pos);
  pushLogIfUnique(l);

  restoreLogger();
}

void tft_logger::drawLine(int32_t x, int32_t y, int32_t x1, int32_t y1,
                          uint32_t color) {
  if (logging)
    checkAndLog(DRAWLINE, x, y, x1, y1, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawLine(x, y, x1, y1, color);
  restoreLogger();
}

void tft_logger::drawRect(int32_t x, int32_t y, int32_t w, int32_t h,
                          uint32_t color) {
  if (logging)
    checkAndLog(DRAWRECT, x, y, w, h, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawRect(x, y, w, h, color);
  restoreLogger();
}

void tft_logger::fillRect(int32_t x, int32_t y, int32_t w, int32_t h,
                          uint32_t color) {
  if (logging) {
    if (w > 4 && h > 4)
      removeLogEntriesInsideRect(x, y, w, h);
    checkAndLog(FILLRECT, x, y, w, h, color);
  }
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::fillRect(x, y, w, h, color);
  restoreLogger();
}

void tft_logger::drawRoundRect(int32_t x, int32_t y, int32_t w, int32_t h,
                               int32_t r, int32_t color) {
  if (logging)
    checkAndLog(DRAWROUNDRECT, x, y, w, h, r, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawRoundRect(x, y, w, h, r, color);
  restoreLogger();
}

void tft_logger::fillRoundRect(int32_t x, int32_t y, int32_t w, int32_t h,
                               int32_t r, int32_t color) {
  if (logging) {
    removeLogEntriesInsideRect(x, y, w, h);
    checkAndLog(FILLROUNDRECT, x, y, w, h, r, color);
  }
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::fillRoundRect(x, y, w, h, r, color);
  restoreLogger();
}

void tft_logger::drawCircle(int32_t x, int32_t y, int32_t r, int32_t color) {
  if (logging)
    checkAndLog(DRAWCIRCLE, x, y, r, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawCircle(x, y, r, color);
  restoreLogger();
}

void tft_logger::fillCircle(int32_t x, int32_t y, int32_t r, int32_t color) {
  if (logging)
    checkAndLog(FILLCIRCLE, x, y, r, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::fillCircle(x, y, r, color);
  restoreLogger();
}

void tft_logger::drawEllipse(int16_t x, int16_t y, int32_t rx, int32_t ry,
                             uint16_t color) {
  if (logging)
    checkAndLog(DRAWELIPSE, x, y, rx, ry, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawEllipse(x, y, rx, ry, color);
  restoreLogger();
}

void tft_logger::fillEllipse(int16_t x, int16_t y, int32_t rx, int32_t ry,
                             uint16_t color) {
  if (logging)
    checkAndLog(FILLELIPSE, x, y, rx, ry, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::fillEllipse(x, y, rx, ry, color);
  restoreLogger();
}

void tft_logger::drawTriangle(int32_t x1, int32_t y1, int32_t x2, int32_t y2,
                              int32_t x3, int32_t y3, int32_t color) {
  if (logging)
    checkAndLog(DRAWTRIAGLE, x1, y1, x2, y2, x3, y3, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawTriangle(x1, y1, x2, y2, x3, y3, color);
  restoreLogger();
}

void tft_logger::fillTriangle(int32_t x1, int32_t y1, int32_t x2, int32_t y2,
                              int32_t x3, int32_t y3, int32_t color) {
  if (logging)
    checkAndLog(FILLTRIANGLE, x1, y1, x2, y2, x3, y3, color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::fillTriangle(x1, y1, x2, y2, x3, y3, color);
  restoreLogger();
}
void tft_logger::drawArc(int32_t x, int32_t y, int32_t r, int32_t ir,
                         uint32_t startAngle, uint32_t endAngle,
                         uint32_t fg_color, uint32_t bg_color, bool smoothArc) {
  if (logging)
    checkAndLog(DRAWARC, x, y, r, ir, (int32_t)startAngle, (int32_t)endAngle,
                (int32_t)fg_color, (int32_t)bg_color);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawArc(x, y, r, ir, startAngle, endAngle, fg_color,
                            bg_color, smoothArc);
  restoreLogger();
}

void tft_logger::drawWideLine(float ax, float ay, float bx, float by, float wd,
                              int32_t fg, int32_t bg) {
  if (logging)
    checkAndLog(DRAWWIDELINE, (uint16_t)ax, (uint16_t)ay, (uint16_t)bx,
                (uint16_t)by, (uint16_t)wd, fg, bg);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawWideLine(ax, ay, bx, by, wd, fg, bg);
  restoreLogger();
}

void tft_logger::drawFastVLine(int32_t x, int32_t y, int32_t h, int32_t fg) {
  if (logging)
    checkAndLog(DRAWFASTVLINE, x, y, h, fg);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawFastVLine(x, y, h, fg);
  restoreLogger();
}

void tft_logger::drawFastHLine(int32_t x, int32_t y, int32_t w, int32_t fg) {
  if (logging)
    checkAndLog(DRAWFASTHLINE, x, y, w, fg);
  if (isSleeping)
    return;
  WILLY_TFT_DRIVER::drawFastHLine(x, y, w, fg);
  restoreLogger();
}

void tft_logger::log_drawString(String s, tftFuncs fn, int32_t x, int32_t y) {
  if (!logging)
    return;
  if (!log)
    return;
  if (removeLogEntriesInsideRect(x, y, s.length() * LW * getTextSize(),
                                 s.length() * LH * getTextSize())) {
    // debug purpose
    // Serial.printf("Something was removed while processing: %s\n", s.c_str());
  }

  uint8_t buffer[MAX_LOG_SIZE];
  uint8_t pos = 0;
  logWriteHeader(buffer, pos, fn);

  writeUint16(buffer, pos, x);
  writeUint16(buffer, pos, y);
  writeUint16(buffer, pos, getTextSize());
  writeUint16(buffer, pos, getTextColor());
  writeUint16(buffer, pos, getTextBgColor());

  size_t maxLen = MAX_LOG_SIZE - pos - 1;
  size_t len = s.length();
  if (len > maxLen)
    len = maxLen;
  memcpy(buffer + pos, s.c_str(), len);
  pos += len;

  buffer[1] = pos;

  tftLog l;
  memcpy(l.data, buffer, pos);
  pushLogIfUnique(l);
  logging = false;
}

int16_t tft_logger::drawString(const String &string, int32_t x, int32_t y,
                               uint8_t font) {
  log_drawString(string, DRAWSTRING, x, y);
  int16_t r;
  if (isSleeping)
    return string.length();
  r = WILLY_TFT_DRIVER::drawString(string.c_str(), x, y, font);
  restoreLogger();
  return r;
}

int16_t tft_logger::drawCentreString(const String &string, int32_t x, int32_t y,
                                     uint8_t font) {
  log_drawString(string, DRAWCENTRESTRING, x, y);
  int16_t r;
  if (isSleeping)
    return string.length();
  r = WILLY_TFT_DRIVER::drawCentreString(string, x, y, font);
  restoreLogger();
  return r;
}

int16_t tft_logger::drawRightString(const String &string, int32_t x, int32_t y,
                                    uint8_t font) {
  log_drawString(string, DRAWRIGHTSTRING, x, y);
  int16_t r;
  if (isSleeping)
    return string.length();
  r = WILLY_TFT_DRIVER::drawRightString(string, x, y, font);
  restoreLogger();
  return r;
}

int16_t tft_logger::drawString(const String &string, int32_t x, int32_t y) {
  return drawString(string, x, y, textfont);
}

int16_t tft_logger::drawCentreString(const String &string, int32_t x,
                                     int32_t y) {
  return drawCentreString(string, x, y, textfont);
}

int16_t tft_logger::drawRightString(const String &string, int32_t x,
                                    int32_t y) {
  return drawRightString(string, x, y, textfont);
}

void tft_logger::log_print(String s) {
  if (!logging)
    return;
  if (!log)
    return;

